DROP TABLE IF EXISTS `cities`;

CREATE TABLE `cities`
(
    `id`   bigint(11) unsigned NOT NULL AUTO_INCREMENT,
    `name` varchar(150) DEFAULT NULL,
    PRIMARY KEY (`id`),
    UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

LOCK
TABLES `cities` WRITE;

INSERT INTO `cities` (`id`, `name`)
VALUES (31, 'Ірпінь'),
       (28, 'Біла Церква'),
       (41, 'Березань'),
       (43, 'Богуслав'),
       (30, 'Бориспіль'),
       (35, 'Боярка'),
       (29, 'Бровари'),
       (13, 'Вінниця'),
       (34, 'Васильків'),
       (37, 'Вишгород'),
       (33, 'Вишневе'),
       (21, 'Горлівка'),
       (4, 'Дніпро'),
       (5, 'Донецьк'),
       (23, 'Житомир'),
       (6, 'Запоріжжя'),
       (45, 'Кагарлик'),
       (24, 'Кам\'янське'),
	(2,'Київ'),
	(8,'Кривий Ріг'),
	(11,'Луганськ'),
	(7,'Львів'),
	(12,'Макіївка'),
	(10,'Маріуполь'),
	(9,'Миколаїв'),
	(48,'Миронівка'),
	(36,'Обухів'),
	(1,'Одеса'),
	(38,'Переяслав'),
	(17,'Полтава'),
	(52,'Прип\'ять'),
       (50, 'Ржищів'),
       (14, 'Сімферополь'),
       (15, 'Севастополь'),
       (44, 'Сквира'),
       (39, 'Славутич'),
       (20, 'Суми'),
       (49, 'Тараща'),
       (46, 'Тетіїв'),
       (47, 'Узин'),
       (42, 'Українка'),
       (32, 'Фастів'),
       (3, 'Харків'),
       (16, 'Херсон'),
       (22, 'Хмельницький'),
       (19, 'Черкаси'),
       (26, 'Чернівці'),
       (18, 'Чернігів'),
       (51, 'Чорнобиль'),
       (40, 'Яготин');

UNLOCK
TABLES;

